LSTM We refer to the mathematical formulation of the LSTM,  - - - -  i_(t)  = σ(W^(i)x_(t)+U^(i)h_(t − 1))   f_(t)  = σ(W^(f)x_(t)+U^(f)h_(t − 1))   o_(t)  = σ(W^(o)x_(t)+U^(o)h_(t − 1))   ${\\overset{\\sim}{c}}_{t}$  = tanh(W^(c)x_(t)+U^(c)h_(t − 1))   c_(t) $= i_{t} \\odot {\\overset{\\sim}{c}}_{t} + f_{t} \\odot + {\\overset{\\sim}{c}}_{t - 1}$   h_(t)  = o_(t) ⊙ tanh(c_(t))  where [W^(i), W^(f), W^(o), U^(i), U^(f), U^(o)] are weight matrices, x_(t) is the vector input to the timestep t, h_(t) is the current exposed hidden state, c_(t) is the memory cell state, and ⊙ is element-wise multiplication. Preventing overfitting within the recurrent connections of an RNN has been an area of extensive research in language modeling. The majority of previous recurrent regularization techniques have acted on the hidden state vector h_(t − 1), most frequently introducing a dropout operation between timesteps, or performing dropout on the update to the memory state c_(t). These modifications to a standard LSTM prevent the use of black box RNN implementations that may be many times faster due to low-level hardware-specific optimizations. We propose the use of DropConnect (Wan et al., 2013) on the recurrent hidden to hidden weight matrices which does not require any modifications to an RNN’s formulation. As the dropout operation is applied once to the weight matrices, before the forward and backward pass, the impact on training speed is minimal and any standard RNN implementation can be used, including inflexible but highly optimized black box LSTM implementations such as NVIDIA’s cuDNN LSTM. By performing DropConnect on the hidden-to-hidden weight matrices [U^(i), U^(f), U^(o), U^(c)] within the LSTM, we can prevent overfitting from occurring on the recurrent connections of the LSTM. This regularization technique would also be applicable to preventing overfitting on the recurrent weight matrices of other RNN cells. As the same weights are reused over multiple timesteps, the same individual dropped weights remain dropped for the entirety of the forward and backward pass. The result is similar to variational dropout, which applies the same dropout mask to recurrent connections within the LSTM by performing dropout on h_(t − 1), except that the dropout is applied to the recurrent weights. DropConnect could also be used on the non-recurrent weights of the LSTM [W^(i), W^(f), W^(o)] though our focus was on preventing overfitting on the recurrent connection.