"In this section we compare various aspects of self-attention layers to the recurrent and convolutional layers commonly used for mapping one variable-length sequence of symbol representations (x₁,…,x_(n)) to another sequence of equal length (z₁,…,z_(n)), with x_(i), z_(i) ∈ ℝ^(d), such as a hidden layer in a typical sequence transduction encoder or decoder. Motivating our use of self-attention we consider three desiderata. One is the total computational complexity per layer. Another is the amount of computation that can be parallelized, as measured by the minimum number of sequential operations required. The third is the path length between long-range dependencies in the network. Learning long-range dependencies is a key challenge in many sequence transduction tasks. One key factor affecting the ability to learn such dependencies is the length of the paths forward and backward signals have to traverse in the network. The shorter these paths between any combination of positions in the input and output sequences, the easier it is to learn long-range dependencies (hochreiter2001gradient, ). Hence we also compare the maximum path length between any two input and output positions in networks composed of the different layer types. Table 1: Maximum path lengths, per-layer complexity and minimum number of sequential operations for different layer types. n is the sequence length, d is the representation dimension, k is the kernel size of convolutions and r the size of the neighborhood in restricted self-attention.   Layer Type                    Complexity per Layer   Sequential   Maximum Path Length   ----------------------------- ---------------------- ------------ ---------------------                                                        Operations      Self-Attention                O(n²⋅d)                O(1)         O(1)   Recurrent                     O(n⋅d²)                O(n)         O(n)   Convolutional                 O(k⋅n⋅d²)              O(1)         O(log_(k)(n))   Self-Attention (restricted)   O(r⋅n⋅d)               O(1)         O(n/r) As noted in Table 1, a self-attention layer connects all positions with a constant number of sequentially executed operations, whereas a recurrent layer requires O(n) sequential operations. In terms of computational complexity, self-attention layers are faster than recurrent layers when the sequence length n is smaller than the representation dimensionality d, which is most often the case with sentence representations used by state-of-the-art models in machine translations, such as word-piece (wu2016google, ) and byte-pair (sennrich2015neural, ) representations. To improve computational performance for tasks involving very long sequences, self-attention could be restricted to considering only a neighborhood of size r in the input sequence centered around the respective output position. This would increase the maximum path length to O(n/r). We plan to investigate this approach further in future work. A single convolutional layer with kernel width k < n does not connect all pairs of input and output positions. Doing so requires a stack of O(n/k) convolutional layers in the case of contiguous kernels, or O(log_(k)(n)) in the case of dilated convolutions (NalBytenet2017, ), increasing the length of the longest paths between any two positions in the network. Convolutional layers are generally more expensive than recurrent layers, by a factor of k. Separable convolutions (xception2016, ), however, decrease the complexity considerably, to O(k ⋅ n ⋅ d+n ⋅ d²). Even with k = n, however, the complexity of a separable convolution is equal to the combination of a self-attention layer and a point-wise feed-forward layer, the approach we take in our model. As side benefit, self-attention could yield more interpretable models. We inspect attention distributions from our models and present and discuss examples in the appendix. Not only do individual attention heads clearly learn to perform different tasks, many appear to exhibit behavior related to the syntactic and semantic structure of the sentences."
